# Numpy Giris

In [1]:
a = [1,2,3,4]
b = [2,3,4,5]

ab = []

for i in range(0, len(a)):
    ab.append(a[i]*b[i])
    
ab

[2, 6, 12, 20]

In [4]:
import numpy as np

a = np.array([1,2,3,4])

b = np.array([2,3,4,5])

a * b

array([ 2,  6, 12, 20])

In [8]:
x = 9

In [14]:
x

9

In [3]:
who

a	 np

In [19]:
L = [1,2, "a", 1.2]
L

[1, 2, 'a', 1.2]

In [20]:
[type(i) for i in L]

[int, int, str, float]

# Numpy Arraylari Olusturma

In [10]:
import numpy as np

np.array([12, 33, 4,5])

a = np.array([12, 33, 4,5])

a

type(a)

numpy.ndarray

In [7]:
who

a	 np

In [5]:
who

a	 np

In [11]:
import numpy as np

In [12]:
who

a	 np

In [13]:
np.array([3.14, 4.6, 1.2])

array([3.14, 4.6 , 1.2 ])

In [14]:
np.array([3.14, 4.6, 1.2], dtype = 'float32')

array([3.14, 4.6 , 1.2 ], dtype=float32)

In [15]:
np.zeros(10, dtype = int)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [19]:
np.ones((2,3))

array([[1., 1., 1.],
       [1., 1., 1.]])

In [20]:
np.full((2,3), 9)

array([[9, 9, 9],
       [9, 9, 9]])

In [21]:
np.arange(0, 10, 2)

array([0, 2, 4, 6, 8])

In [22]:
np.linspace(0, 1, 30)

array([0.        , 0.03448276, 0.06896552, 0.10344828, 0.13793103,
       0.17241379, 0.20689655, 0.24137931, 0.27586207, 0.31034483,
       0.34482759, 0.37931034, 0.4137931 , 0.44827586, 0.48275862,
       0.51724138, 0.55172414, 0.5862069 , 0.62068966, 0.65517241,
       0.68965517, 0.72413793, 0.75862069, 0.79310345, 0.82758621,
       0.86206897, 0.89655172, 0.93103448, 0.96551724, 1.        ])

In [23]:
np.random.normal(0, 1, (3,4))

array([[-1.07978175, -1.2851162 , -0.21578045, -1.87363517],
       [-0.90739551,  0.37708237, -0.32660519, -0.8638548 ],
       [ 0.68562666, -0.54837635, -0.36534416, -0.71588101]])

In [24]:
np.random.randint(0, 10, (2,2))

array([[5, 2],
       [7, 4]])

In [25]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

# Numpy Bicimlendirme

* **ndim**  : boyut sayisi
* **shape** : boyut bilgisi
* **size**  : toplam eleman sayisi
* **dtype** : array veri tipi

In [30]:
import numpy as np

a = np.random.randint(10, size = 10)
a.ndim
a.shape
a.size
a.dtype

dtype('int32')

In [31]:
a = np.random.randint(10, size = (10, 5))

In [32]:
a.ndim

2

In [33]:
a.shape

(10, 5)

In [34]:
a

array([[7, 4, 7, 1, 3],
       [1, 2, 6, 5, 0],
       [7, 1, 3, 2, 8],
       [6, 8, 0, 3, 8],
       [4, 6, 9, 6, 3],
       [9, 4, 3, 2, 0],
       [4, 1, 7, 8, 8],
       [8, 4, 9, 8, 0],
       [6, 3, 9, 2, 9],
       [9, 5, 3, 5, 8]])

In [35]:
a.size

50

In [36]:
a.dtype

dtype('int32')

In [38]:
a = np.random.randint(10, size = (3, 5, 2))

In [39]:
a

array([[[7, 3],
        [0, 4],
        [2, 5],
        [8, 2],
        [7, 7]],

       [[0, 3],
        [5, 5],
        [4, 7],
        [6, 9],
        [6, 7]],

       [[0, 2],
        [8, 6],
        [9, 5],
        [7, 2],
        [6, 1]]])

In [40]:
a.ndim

3

In [41]:
a.shape

(3, 5, 2)

In [42]:
a

array([[[7, 3],
        [0, 4],
        [2, 5],
        [8, 2],
        [7, 7]],

       [[0, 3],
        [5, 5],
        [4, 7],
        [6, 9],
        [6, 7]],

       [[0, 2],
        [8, 6],
        [9, 5],
        [7, 2],
        [6, 1]]])

In [43]:
a.size

30

In [44]:
a.dtype

dtype('int32')

In [45]:
np.arange(1, 10)

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [46]:
np.arange(1, 10).reshape((3, 3))

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
a = np.array([1, 2, 3])

In [48]:
a

array([1, 2, 3])

In [49]:
a.reshape((1, 3))

array([[1, 2, 3]])

In [50]:
b = a.reshape((1, 3))

In [51]:
b.ndim

2

In [52]:
a.ndim

1

In [53]:
b

array([[1, 2, 3]])

In [54]:
a

array([1, 2, 3])

In [55]:
a[np.newaxis, :]

array([[1, 2, 3]])

In [56]:
a[:]

array([[1],
       [2],
       [3]])

In [60]:
x = np.array([1,2,3])

In [61]:
x

array([1, 2, 3])

In [62]:
y = np.array([4,5,6])

In [63]:
y

array([4, 5, 6])

In [64]:
np.concatenate([x, y])

array([1, 2, 3, 4, 5, 6])

In [66]:
z = [1,2,3]

In [67]:
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 1, 2, 3])

In [68]:
a = np.array([[1,2,3],
              [4,5,6]])
a

array([[1, 2, 3],
       [4, 5, 6]])

In [69]:
np.concatenate([a,a])

array([[1, 2, 3],
       [4, 5, 6],
       [1, 2, 3],
       [4, 5, 6]])

In [70]:
np.concatenate([a,a], axis = 1)

array([[1, 2, 3, 1, 2, 3],
       [4, 5, 6, 4, 5, 6]])

In [71]:
a = np.array([1,2,3])

In [72]:
b = np.array([[9,8,7],
              [6,5,4]])

In [73]:
a

array([1, 2, 3])

In [75]:
b

array([[9, 8, 7],
       [6, 5, 4]])

In [76]:
np.vstack([a,b])

array([[1, 2, 3],
       [9, 8, 7],
       [6, 5, 4]])

In [77]:
a = np.array([[99],
              [99]])

In [78]:
a

array([[99],
       [99]])

In [79]:
np.hstack([a,b])

array([[99,  9,  8,  7],
       [99,  6,  5,  4]])

# Array Splitting

In [81]:
x = [1,2,3,99,99,3,2,1]
x

[1, 2, 3, 99, 99, 3, 2, 1]

In [82]:
np.split(x, [3,5])

[array([1, 2, 3]), array([99, 99]), array([3, 2, 1])]

In [83]:
a, b, c = np.split(x, [3,5])

In [84]:
a

array([1, 2, 3])

In [85]:
b

array([99, 99])

In [86]:
c

array([3, 2, 1])

In [89]:
m = np.arange(16).reshape([4,4])

In [90]:
np.vsplit(m, [2])

[array([[0, 1, 2, 3],
        [4, 5, 6, 7]]),
 array([[ 8,  9, 10, 11],
        [12, 13, 14, 15]])]

In [91]:
ust, alt = np.vsplit(m, [2])

In [92]:
ust

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [93]:
alt

array([[ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [94]:
m

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [95]:
np.hsplit(m, [2])

[array([[ 0,  1],
        [ 4,  5],
        [ 8,  9],
        [12, 13]]),
 array([[ 2,  3],
        [ 6,  7],
        [10, 11],
        [14, 15]])]

In [96]:
sol, sag = np.hsplit(m, [2])

In [97]:
sol

array([[ 0,  1],
       [ 4,  5],
       [ 8,  9],
       [12, 13]])

In [98]:
sag

array([[ 2,  3],
       [ 6,  7],
       [10, 11],
       [14, 15]])

# Array Siralama - Sort

In [105]:
v = np.array([2,1,4,3,5])

In [100]:
v

array([2, 1, 4, 3, 5])

In [101]:
np.sort(v)

array([1, 2, 3, 4, 5])

In [102]:
v

array([2, 1, 4, 3, 5])

In [103]:
v.sort()

In [106]:
v

array([2, 1, 4, 3, 5])

In [107]:
i = np.argsort(v)

In [108]:
i

array([1, 0, 3, 2, 4], dtype=int64)

In [109]:
v

array([2, 1, 4, 3, 5])

In [110]:
v[i]

array([1, 2, 3, 4, 5])

In [111]:
np.array([3.14, 4,6,1.2])

array([3.14, 4.  , 6.  , 1.2 ])

In [115]:
a = np.ones((2,3))

In [116]:
a.ndim

2

In [117]:
a.size

6

In [118]:
a.shape

(2, 3)

In [120]:
np.random.randint(10, size = (1,2,3))

array([[[3, 1, 0],
        [4, 7, 8]]])

In [121]:
np.random.randint(10, size = (3,3,2))

array([[[3, 7],
        [6, 5],
        [3, 6]],

       [[2, 5],
        [2, 6],
        [9, 5]],

       [[5, 9],
        [7, 2],
        [8, 7]]])

In [122]:
np.arange(0,10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [123]:
np.arange(1,10)

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [124]:
5*np.array([1, 2,3])

array([ 5, 10, 15])

In [125]:
np.array([1, 2,3])

array([1, 2, 3])

In [126]:
5 * np.array([1, 2,3])

array([ 5, 10, 15])

In [127]:
np.arange(0,10, 2)

array([0, 2, 4, 6, 8])

In [128]:
v = np.array([2, 1, 4, 3, 5])
np.sort(v)

array([1, 2, 3, 4, 5])

In [129]:
a = np.random.randint(10, size = 10)

In [130]:
a

array([6, 2, 4, 8, 3, 8, 7, 0, 8, 9])

In [131]:
a[0]

6

In [132]:
a[-1]

9

In [133]:
a[0] = 1

In [134]:
a

array([1, 2, 4, 8, 3, 8, 7, 0, 8, 9])

In [135]:
a = np.random.randint(10, size = (3,5))

In [136]:
a

array([[4, 9, 4, 7, 3],
       [3, 0, 6, 2, 2],
       [5, 0, 6, 2, 4]])

In [137]:
a[0,0]

4

In [138]:
a[1,1]

0

In [139]:
a[0,0] = 5

In [140]:
a[0,0]

5

In [141]:
a

array([[5, 9, 4, 7, 3],
       [3, 0, 6, 2, 2],
       [5, 0, 6, 2, 4]])

In [142]:
a[1,3] = 2.2

In [143]:
a

array([[5, 9, 4, 7, 3],
       [3, 0, 6, 2, 2],
       [5, 0, 6, 2, 4]])

In [144]:
a[0, 1] = 2.2

In [145]:
a

array([[5, 2, 4, 7, 3],
       [3, 0, 6, 2, 2],
       [5, 0, 6, 2, 4]])

In [146]:
a = np.arange(20, 30)

In [147]:
a

array([20, 21, 22, 23, 24, 25, 26, 27, 28, 29])

In [148]:
a[0:3]

array([20, 21, 22])

In [149]:
a[:3]

array([20, 21, 22])

In [150]:
a[3:]

array([23, 24, 25, 26, 27, 28, 29])

In [151]:
a[::2]

array([20, 22, 24, 26, 28])

In [152]:
a[1::2]

array([21, 23, 25, 27, 29])

In [153]:
a = np.random.randint(10, size = (5,5))

In [154]:
a

array([[7, 5, 4, 7, 8],
       [7, 9, 9, 7, 3],
       [3, 4, 3, 4, 6],
       [0, 4, 3, 5, 0],
       [1, 2, 1, 3, 6]])

In [155]:
a[:,0]

array([7, 7, 3, 0, 1])

In [156]:
a[:]

array([[7, 5, 4, 7, 8],
       [7, 9, 9, 7, 3],
       [3, 4, 3, 4, 6],
       [0, 4, 3, 5, 0],
       [1, 2, 1, 3, 6]])

In [157]:
a[:0]

array([], shape=(0, 5), dtype=int32)

In [158]:
a[:,1]

array([5, 9, 4, 4, 2])

In [159]:
a[0,:]

array([7, 5, 4, 7, 8])

In [160]:
a[:2,:3]

array([[7, 5, 4],
       [7, 9, 9]])

In [161]:
a[0:2,0:3]

array([[7, 5, 4],
       [7, 9, 9]])

In [162]:
a[:,:2]

array([[7, 5],
       [7, 9],
       [3, 4],
       [0, 4],
       [1, 2]])

In [164]:
a[1:3,:]

array([[7, 9, 9, 7, 3],
       [3, 4, 3, 4, 6]])

In [165]:
a = np.random.randint(10, size = (5,5))

In [166]:
a

array([[9, 5, 9, 0, 2],
       [2, 4, 2, 6, 5],
       [3, 5, 5, 5, 9],
       [9, 1, 4, 4, 0],
       [3, 7, 7, 5, 0]])

In [167]:
alt_a = a[0:3,0:2]

In [168]:
alt_a

array([[9, 5],
       [2, 4],
       [3, 5]])

In [169]:
alt_a[0,0] = 9999

In [170]:
alt_a[1,1] = 8888

In [171]:
a

array([[9999,    5,    9,    0,    2],
       [   2, 8888,    2,    6,    5],
       [   3,    5,    5,    5,    9],
       [   9,    1,    4,    4,    0],
       [   3,    7,    7,    5,    0]])

In [172]:
alt_a

array([[9999,    5],
       [   2, 8888],
       [   3,    5]])

In [173]:
alt_b = a[0:3,0:2].copy()

In [174]:
alt_b

array([[9999,    5],
       [   2, 8888],
       [   3,    5]])

In [175]:
alt_b[0,0] = 1111

In [176]:
alt_b

array([[1111,    5],
       [   2, 8888],
       [   3,    5]])

In [177]:
a

array([[9999,    5,    9,    0,    2],
       [   2, 8888,    2,    6,    5],
       [   3,    5,    5,    5,    9],
       [   9,    1,    4,    4,    0],
       [   3,    7,    7,    5,    0]])

In [178]:
v = np.arange(0, 30, 3)

In [179]:
v

array([ 0,  3,  6,  9, 12, 15, 18, 21, 24, 27])

In [180]:
v[1]

3

In [181]:
v[3]

9

In [182]:
[v[1], v[3]]

[3, 9]

In [183]:
al_getir = [1, 3, 5]

In [184]:
v[al_getir]

array([ 3,  9, 15])

In [199]:
m = np.arange(9).reshape((3,3))

In [200]:
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [201]:
satir = np.array([0,1])

In [202]:
sutun = np.array([1,2])

In [203]:
satir

array([0, 1])

In [204]:
sutun

array([1, 2])

In [206]:
m[satir, sutun]

array([1, 5])

In [207]:
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [209]:
m[0,[0,2]]

array([0, 2])

In [210]:
m[0:,[1,2]]

array([[1, 2],
       [4, 5],
       [7, 8]])

In [211]:
v = np.arange(10)

In [212]:
v

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [215]:
index = np.array([0,1,2])
index

array([0, 1, 2])

In [216]:
v[index]

array([0, 1, 2])

In [217]:
v

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [218]:
v[index] = 99

In [219]:
v

array([99, 99, 99,  3,  4,  5,  6,  7,  8,  9])

In [220]:
v[[0,1]] = [4,6]

In [221]:
v

array([ 4,  6, 99,  3,  4,  5,  6,  7,  8,  9])

# Kosullu Elaman Islemlari

In [222]:
v = np.array([1,2,3,4,5])

In [223]:
v > 3

array([False, False, False,  True,  True])

In [224]:
v <= 3

array([ True,  True,  True, False, False])

In [225]:
v ++ 3

array([4, 5, 6, 7, 8])

In [226]:
v

array([1, 2, 3, 4, 5])

In [227]:
v == 3

array([False, False,  True, False, False])

In [228]:
v != 3

array([ True,  True, False,  True,  True])

In [229]:
(2 * v)

array([ 2,  4,  6,  8, 10])

In [230]:
(v ** 2)

array([ 1,  4,  9, 16, 25], dtype=int32)

In [231]:
(2 * v) == (v ** 2)

array([False,  True, False, False, False])

# ufunc

np.equal
np.not_equal
np.less
np.less_equal
np.greater
np.greated_equal

In [234]:
v = np.array([1,2,3,4,5])

In [235]:
v

array([1, 2, 3, 4, 5])

In [236]:
np.equal(3,v)

array([False, False,  True, False, False])

In [237]:
np.equal([0,1,3], np.arange(3))

array([ True,  True, False])

In [238]:
v = np.random.randint(0, 10, (3,3))
v

array([[2, 7, 8],
       [9, 5, 1],
       [3, 9, 5]])

In [239]:
v > 5

array([[False,  True,  True],
       [ True, False, False],
       [False,  True, False]])

In [240]:
np.sum(v > 5)

4

In [241]:
np.sum((v>3) & (v<7))

2

In [242]:
np.sum((v>3) | (v<7))

9

In [243]:
np.sum( v > 4 , axis = 1)

array([2, 2, 2])

In [244]:
np.sum( v > 4 , axis = 0)

array([1, 3, 2])

In [245]:
np.all(v > 4)

False

In [246]:
np.all(v > 0)

True

In [247]:
np.any(v > 4)

True

In [248]:
np.all(v > 4, axis = 0)

array([False,  True, False])

In [249]:
np.all(v>4, axis=1)

array([False, False, False])

In [250]:
v

array([[2, 7, 8],
       [9, 5, 1],
       [3, 9, 5]])

In [251]:
v = np.array([1,2,3,4,5])

In [252]:
v

array([1, 2, 3, 4, 5])

In [253]:
v[0]

1

In [254]:
v > 3

array([False, False, False,  True,  True])

In [255]:
v[v>3]

array([4, 5])

In [256]:
v[v<3]

array([1, 2])

In [257]:
v[(v>1)&(v<5)]

array([2, 3, 4])

# Numpy Hesaplamali Islemler

In [258]:
a = np.arange(5)

In [259]:
a

array([0, 1, 2, 3, 4])

In [260]:
a - 1

array([-1,  0,  1,  2,  3])

In [261]:
a

array([0, 1, 2, 3, 4])

In [262]:
a /2

array([0. , 0.5, 1. , 1.5, 2. ])

In [263]:
a*5

array([ 0,  5, 10, 15, 20])

In [264]:
a % 2

array([0, 1, 0, 1, 0], dtype=int32)

In [265]:
5*(a/2*9)

array([ 0. , 22.5, 45. , 67.5, 90. ])

In [266]:
np.add(a,2)

array([2, 3, 4, 5, 6])

In [267]:
a

array([0, 1, 2, 3, 4])

In [268]:
np.subtract(a,2)

array([-2, -1,  0,  1,  2])

In [269]:
np.multiply(a, 5)

array([ 0,  5, 10, 15, 20])

In [270]:
np.divide(a,2)

array([0. , 0.5, 1. , 1.5, 2. ])

In [271]:
np.power(a, 3)

array([ 0,  1,  8, 27, 64], dtype=int32)

In [2]:
a = np.arange(1,6)

NameError: name 'np' is not defined

In [1]:
a

NameError: name 'a' is not defined

In [274]:
a

array([1, 2, 3, 4, 5])

In [275]:
np.add.reduce(a)

15

In [276]:
np.add.accumulate(a)

array([ 1,  3,  6, 10, 15], dtype=int32)

In [277]:
a = np.random.normal(0, 1, 30)

In [278]:
a

array([ 0.91902195,  0.18721463, -2.19359069, -1.30154975,  0.37757584,
       -0.38216087,  1.34555869, -1.03095754, -0.43525802, -1.19890818,
       -0.55822988,  0.08909568, -0.80401279,  0.00985636, -0.89225448,
        0.37305913, -0.10641434,  0.55475262,  0.08716859, -2.60653861,
        0.23093488, -0.10288482,  0.92618397, -1.01218531, -1.00386895,
       -0.04964487,  1.24750901,  0.25639047,  1.06182705, -0.41346049])

In [279]:
np.mean(a)

-0.21419235735388406

In [280]:
np.std(a)

0.9255093102749051

In [281]:
np.var(a)

0.8565674834055306

In [282]:
np.median(a)

-0.07626484504705026

In [283]:
sum(a)

-6.425770720616524

np.nanmean(a)

np.nanstd(a)

np.nanvar(a)

np.nanargmin(a)

np.nanargmax(a)

np.nanmedian(a)

In [284]:
np.min(a)

-2.606538612557736

In [285]:
np.max(a)

1.3455586866157148

In [286]:
a = np.random.normal(0,1, (3,3))

In [287]:
a

array([[ 0.52647818,  2.93634494, -0.07108156],
       [ 1.7407151 , -0.50328491,  0.72161833],
       [-1.02033545,  0.77566242, -0.02686068]])

In [288]:
a.sum()

5.0792563652285345

In [289]:
a.sum(axis = 1)

array([ 3.39174156,  1.95904852, -0.27153371])

In [290]:
a.sum(axis = 0)

array([1.24685782, 3.20872246, 0.62367608])

# Farkli Boyutlu Arrayler ile Birlikte Calismak (Broadcasting)

In [293]:
a = np.array([1,2,3])
b = np.array([1,2,3])

a + b

array([2, 4, 6])

In [294]:
m = np.ones((3,3))
m

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [295]:
a + m

array([[2., 3., 4.],
       [2., 3., 4.],
       [2., 3., 4.]])

In [298]:
a = np.arange(3)
a

array([0, 1, 2])

In [300]:
b = np.arange(3)[:, np.newaxis]
b

array([[0],
       [1],
       [2]])

In [301]:
a + b

array([[0, 1, 2],
       [1, 2, 3],
       [2, 3, 4]])

In [302]:
M = np.ones((2,3))
M

array([[1., 1., 1.],
       [1., 1., 1.]])

In [303]:
a = np.arange(3)
a

array([0, 1, 2])

In [304]:
a + M

array([[1., 2., 3.],
       [1., 2., 3.]])

In [305]:
a = np.arange(3).reshape((3,1))
a

array([[0],
       [1],
       [2]])

In [306]:
b = np.arange(3)

In [307]:
b

array([0, 1, 2])

In [308]:
a.shape

(3, 1)

In [311]:
b.shape

(3,)

In [312]:
a + b

array([[0, 1, 2],
       [1, 2, 3],
       [2, 3, 4]])

In [313]:
m = np.ones((3,2))
m

array([[1., 1.],
       [1., 1.],
       [1., 1.]])

In [314]:
a = np.arange(3)
a

array([0, 1, 2])

In [315]:
m.shape

(3, 2)

In [316]:
a.shape

(3,)

In [317]:
a + m

ValueError: operands could not be broadcast together with shapes (3,) (3,2)

# Numpy Yapisal Arrayler

# Hello! Goodbye! Numpy

In [319]:
isim = ['ali', 'veli', 'isik']
yas = [25, 22, 19]
boy = [168, 159, 172]

In [321]:
data = np.zeros(3, dtype={'names':('isim', 'yas', 'boy'),
                          'formats':('U10', 'i4', 'f8')})

In [322]:
data

array([('', 0, 0.), ('', 0, 0.), ('', 0, 0.)],
      dtype=[('isim', '<U10'), ('yas', '<i4'), ('boy', '<f8')])

In [323]:
data['isim'] = isim
data['yas'] = yas
data['boy'] = boy

In [324]:
data

array([('ali', 25, 168.), ('veli', 22, 159.), ('isik', 19, 172.)],
      dtype=[('isim', '<U10'), ('yas', '<i4'), ('boy', '<f8')])

In [325]:
data['isim']

array(['ali', 'veli', 'isik'], dtype='<U10')

In [326]:
data[0]

('ali', 25, 168.)

In [329]:
data[data['yas'] < 25]['isim']

array(['veli', 'isik'], dtype='<U10')

In [330]:
v = np.array([7, 3, 4, 7, 0, 9, 3, 2, 2])

In [331]:
v[5]

9

In [332]:
v = np.array([7, 3, 4, 7, 0, 9, 3, 2, 9, 2])
v[-2]

9

In [334]:
a = np.array([[4, 7, 4, 5, 9],

            [2, 5, 0, 7, 7],

            [1, 9, 0, 8, 2]])


a[1,1]

5

In [339]:
a = np.array([[4, 0, 3, 0, 1],

            [9, 6, 1, 5, 9],

            [1, 9, 0, 8, 2]])

a[0:1]

array([[4, 0, 3, 0, 1]])

In [340]:
v = np.array([ 0, 3, 6, 9, 12, 15, 18, 21, 24, 27])

[v[1], v[3]]

[3, 9]

In [341]:
v = np.array([ 0, 3, 6, 9, 12, 15, 18, 21, 24, 27])
 
v[[1,2,3]]

array([3, 6, 9])

In [342]:
m = np.array([[0, 1, 2],

             [3, 4, 5],

             [6, 7, 8]])


m[0, [1,2]]

array([1, 2])

In [344]:
import numpy as np
import pandas as pd

In [345]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [346]:
seri = pd.Series([1,2,3,4])

In [347]:
seri

0    1
1    2
2    3
3    4
dtype: int64

In [348]:
type(seri)

pandas.core.series.Series

In [349]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [350]:
seri.axes()

TypeError: 'list' object is not callable

In [351]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [352]:
seri.dtype

dtype('int64')

In [353]:
seri.size

4

In [354]:
seri.ndim

1

In [355]:
seri.values

array([1, 2, 3, 4], dtype=int64)

In [356]:
seri.head(2)

0    1
1    2
dtype: int64

In [357]:
seri[0:3]

0    1
1    2
2    3
dtype: int64

In [358]:
seri.tail(2)

2    3
3    4
dtype: int64

In [359]:
a = np.array([1,2,3,566,88])

In [360]:
a

array([  1,   2,   3, 566,  88])

In [361]:
type(a)

numpy.ndarray

In [362]:
seri = pd.Series(a)

In [363]:
seri

0      1
1      2
2      3
3    566
4     88
dtype: int32

In [364]:
seri.index

RangeIndex(start=0, stop=5, step=1)

In [365]:
seri[0]

1

In [366]:
pd.Series([1,5,0.9,34], index= [1,3,5,7])

1     1.0
3     5.0
5     0.9
7    34.0
dtype: float64

In [371]:
seri = pd.Series([1,5,0.9,34], index = ['a','b','c','d'])

In [372]:
seri["a"]

1.0

In [373]:
sozluk = { "reg" : 10, "loj" : 11, "cart" : 12 }

In [374]:
sozluk

{'reg': 10, 'loj': 11, 'cart': 12}

In [375]:
pd.Series(sozluk)

reg     10
loj     11
cart    12
dtype: int64

In [376]:
seri = pd.Series(sozluk)

In [377]:
seri

reg     10
loj     11
cart    12
dtype: int64

In [378]:
seri["reg"]

10

In [380]:
seri["loj":"cart"]

loj     11
cart    12
dtype: int64

In [381]:
seri

reg     10
loj     11
cart    12
dtype: int64

In [382]:
pd.concat([seri, seri])

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

In [385]:
seri.append(seri)

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

# Serilerde Eleman Islemleri

In [4]:
import numpy as np
import pandas as pd
a = np.array([1,2,3,33,55,66])
seri = pd.Series(a)
seri

0     1
1     2
2     3
3    33
4    55
5    66
dtype: int32

In [5]:
seri[0]

1

In [7]:
seri[0:3]

0    1
1    2
2    3
dtype: int32

In [10]:
seri = pd.Series([121,200,150,99],
                   index=["reg","loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [11]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [12]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [13]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [14]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [15]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [16]:
"reg" in seri

True

In [17]:
"cnn" in seri

False

In [18]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [19]:
seri["reg"]

121

In [21]:
seri[['rf', 'reg']]

rf      99
reg    121
dtype: int64

In [22]:
seri["rf"] = 125

In [23]:
seri

reg     121
loj     200
cart    150
rf      125
dtype: int64

In [24]:
seri['loj': 'rf']

loj     200
cart    150
rf      125
dtype: int64

In [25]:
seri[0:2]

reg    121
loj    200
dtype: int64

In [26]:
seri = pd.Series([121, 200, 150, 99], index = ["reg", "loj", "cart", "rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [31]:
seri[(seri > 125) & (seri < 200)]

cart    150
dtype: int64

# Serilerde Index Problemi

In [32]:
data = pd.Series(['a', 'b', 'c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [36]:
data[1]

'a'

In [37]:
data[1:3]

3    b
5    c
dtype: object

In [38]:
data[0:3]

1    a
3    b
5    c
dtype: object

# label based indexing, tanimlandigi sekli ile index yakalamak

In [39]:
data

1    a
3    b
5    c
dtype: object

In [43]:
data.loc[3]

'b'

In [44]:
data.loc[0:1]

1    a
dtype: object

# iloc - positional indexing, index i sifirlayarak yakalamak

In [45]:
data

1    a
3    b
5    c
dtype: object

In [50]:
data.iloc[2]

'c'

In [51]:
data.iloc[0:3]

1    a
3    b
5    c
dtype: object

# Pandas DataFrame Ozellikleri & Olusturma

In [52]:
l = [1, 4, 577, 343]
l

[1, 4, 577, 343]

In [55]:
df = pd.DataFrame(l, columns = ['degisken_ismi'])
df

   degisken_ismi
0              1
1              4
2            577
3            343

In [56]:
type(df)

pandas.core.frame.DataFrame

In [57]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['degisken_ismi'], dtype='object')]

In [58]:
df.shape

(4, 1)

In [59]:
df.ndim

2

In [60]:
df.size

4

In [61]:
df.values

array([[  1],
       [  4],
       [577],
       [343]], dtype=int64)

In [62]:
df.head(2)

   degisken_ismi
0              1
1              4

In [63]:
df.tail(2)

   degisken_ismi
2            577
3            343

In [64]:
a = np.array([1,2,3,4,56])

In [65]:
a

array([ 1,  2,  3,  4, 56])

In [67]:
pd.DataFrame(a, columns = ['degisken_ismi'])

   degisken_ismi
0              1
1              2
2              3
3              4
4             56

In [68]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [69]:
pd.DataFrame(m, columns = ['var1', 'var2', 'var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [70]:
df = pd.DataFrame(m, columns = ['var1', 'var2', 'var3'])

In [71]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [72]:
df.columns = ('col1', 'col2', 'col3')

In [73]:
df

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [74]:
df = pd.DataFrame(m, columns = ['var1', 'var2', 'var3'], index = ['a', 'b', 'c'])
df

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

In [75]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [77]:
pd.DataFrame(pd.Series([1,2,3,4]), columns = ['col1'])

   col1
0     1
1     2
2     3
3     4

In [78]:
bir = pd.Series([1,2,3,4])
iki = pd.Series([1,2,3,4])

In [79]:
pd.DataFrame({'degisken1': bir,
              'degisken2': iki})

   degisken1  degisken2
0          1          1
1          2          2
2          3          3
3          4          4

In [81]:
sozluk = {"reg": { "RMSE": 10,
                    "MSE": 11,
                    "SSE": 90},
          "loj": { "RMSE": 10,
                    "MSE": 11,
                    "SSE": 90},
          "cart": { "RMSE": 10,
                    "MSE": 11,
                    "SSE": 90}}

In [82]:
sozluk

{'reg': {'RMSE': 10, 'MSE': 11, 'SSE': 90},
 'loj': {'RMSE': 10, 'MSE': 11, 'SSE': 90},
 'cart': {'RMSE': 10, 'MSE': 11, 'SSE': 90}}

In [83]:
pd.DataFrame(sozluk)

      reg  loj  cart
RMSE   10   10    10
MSE    11   11    11
SSE    90   90    90

# DataFrame Eleman Islemleri

In [84]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2, "var3": s3})
df

   var1  var2  var3
0     0     9     3
1     0     7     6
2     4     3     0
3     8     4     7
4     1     0     0

In [85]:
df[0:1]

   var1  var2  var3
0     0     9     3

In [86]:
df[0:2]

   var1  var2  var3
0     0     9     3
1     0     7     6

In [96]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [97]:
df

   var1  var2  var3
a     0     9     3
b     0     7     6
c     4     3     0
d     8     4     7
e     1     0     0

In [98]:
df['c':'e']

   var1  var2  var3
c     4     3     0
d     8     4     7
e     1     0     0

In [99]:
df.drop('a', axis = 0)

   var1  var2  var3
b     0     7     6
c     4     3     0
d     8     4     7
e     1     0     0

In [100]:
df

   var1  var2  var3
a     0     9     3
b     0     7     6
c     4     3     0
d     8     4     7
e     1     0     0

In [102]:
df.drop('a', axis = 0, inplace = True)

In [103]:
df

   var1  var2  var3
b     0     7     6
c     4     3     0
d     8     4     7
e     1     0     0

In [105]:
l = ['b', 'c']

In [106]:
l

['b', 'c']

In [107]:
df.drop(l, axis = 0)

   var1  var2  var3
d     8     4     7
e     1     0     0

In [108]:
df

   var1  var2  var3
b     0     7     6
c     4     3     0
d     8     4     7
e     1     0     0

In [109]:
'var1' in df

True

In [110]:
l = ['var1', 'var2', 'var4']

In [111]:
l

['var1', 'var2', 'var4']

In [112]:
for i in l:
    print(i in df)

True
True
False

In [113]:
df['var1'] is df['var1']

True

In [114]:
df['var2']

b    7
c    3
d    4
e    0
Name: var2, dtype: int32

In [116]:
df.var1

b    0
c    4
d    8
e    1
Name: var1, dtype: int32

In [117]:
df[['var1', 'var2']]

   var1  var2
b     0     7
c     4     3
d     8     4
e     1     0

In [118]:
l = ['var1', 'var2']
df[l]

   var1  var2
b     0     7
c     4     3
d     8     4
e     1     0

In [119]:
df['var4'] = df['var1'] / df['var2']

In [120]:
df

   var1  var2  var3      var4
b     0     7     6  0.000000
c     4     3     0  1.333333
d     8     4     7  2.000000
e     1     0     0       inf

# Gozlem ve Degiskenlere Birlikte Erismek

In [121]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2, "var3": s3})
df

   var1  var2  var3
0     1     0     2
1     2     5     4
2     5     8     2
3     6     6     0
4     2     6     0

In [122]:
df.loc[0:3]

   var1  var2  var3
0     1     0     2
1     2     5     4
2     5     8     2
3     6     6     0

In [123]:
df.iloc[0:3]

   var1  var2  var3
0     1     0     2
1     2     5     4
2     5     8     2

In [125]:
df.iloc[0,0]

1

In [127]:
df.iloc[:3,:2]

   var1  var2
0     1     0
1     2     5
2     5     8

In [129]:
df.iloc[2:6,1:3]

   var2  var3
2     8     2
3     6     0
4     6     0

In [130]:
df.loc[0:3, 'var3']

0    2
1    4
2    2
3    0
Name: var3, dtype: int32

In [131]:
df.loc[0:3, 'var2':'var3']

   var2  var3
0     0     2
1     5     4
2     8     2
3     6     0

In [135]:
df.iloc[0:3, 1:3]

   var2  var3
0     0     2
1     5     4
2     8     2

In [136]:
df.index = ["a", "b", "c", "d", "e" ]

In [137]:
df

   var1  var2  var3
a     1     0     2
b     2     5     4
c     5     8     2
d     6     6     0
e     2     6     0

In [142]:
df.loc["c":"d", "var2":"var3"]

   var2  var3
c     8     2
d     6     0

In [143]:
df

   var1  var2  var3
a     1     0     2
b     2     5     4
c     5     8     2
d     6     6     0
e     2     6     0

In [145]:
df[df.var1 > 5]['var2']

d    6
Name: var2, dtype: int32

In [146]:
df[(df.var1 > 5) & (df.var3 < 7)]

   var1  var2  var3
d     6     6     0

In [151]:
df.loc[df.var1 > 5, ['var1', 'var2']]

   var1  var2
d     6     6

In [152]:
df.loc

In [182]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df1 = pd.DataFrame({"var1": s1, "var2": s2, "var3": s3})
df1

   var1  var2  var3
0     7     5     2
1     6     0     2
2     2     0     0
3     6     0     0
4     7     8     2

In [183]:
df2 = df1 + 99

In [184]:
df2

   var1  var2  var3
0   106   104   101
1   105    99   101
2   101    99    99
3   105    99    99
4   106   107   101

In [159]:
pd.concat([df1, df2], axis = 1)

   var1  var2  var3  var1  var2  var3
0     2     8     5   101   107   104
1     3     4     5   102   103   104
2     1     8     3   100   107   102
3     7     9     9   106   108   108
4     7     3     3   106   102   102

In [160]:
pd.concat([df1, df2])

   var1  var2  var3
0     2     8     5
1     3     4     5
2     1     8     3
3     7     9     9
4     7     3     3
0   101   107   104
1   102   103   104
2   100   107   102
3   106   108   108
4   106   102   102

In [185]:
pd.concat([df1, df2], ignore_index = True)

   var1  var2  var3
0     7     5     2
1     6     0     2
2     2     0     0
3     6     0     0
4     7     8     2
5   106   104   101
6   105    99   101
7   101    99    99
8   105    99    99
9   106   107   101

In [186]:
df2.columns = ["var1","var2","deg3"]

In [187]:
df2

   var1  var2  deg3
0   106   104   101
1   105    99   101
2   101    99    99
3   105    99    99
4   106   107   101

In [188]:
df1

   var1  var2  var3
0     7     5     2
1     6     0     2
2     2     0     0
3     6     0     0
4     7     8     2

In [189]:
pd.concat([df1, df2], join  = 'inner')

   var1  var2
0     7     5
1     6     0
2     2     0
3     6     0
4     7     8
0   106   104
1   105    99
2   101    99
3   105    99
4   106   107

In [192]:
pd.concat([df1, df2], axis = 0)

   var1  var2  var3   deg3
0     7     5   2.0    NaN
1     6     0   2.0    NaN
2     2     0   0.0    NaN
3     6     0   0.0    NaN
4     7     8   2.0    NaN
0   106   104   NaN  101.0
1   105    99   NaN  101.0
2   101    99   NaN   99.0
3   105    99   NaN   99.0
4   106   107   NaN  101.0

In [3]:
import numpy as np
import pandas as pd

s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df1 = pd.DataFrame({"var1": s1, "var2": s2, "var3": s3})
df2 = df1 + 99

df2.columns = ["var1","var2","deg3"]

pd.concat([df1, df2], join_axes = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [4]:
help concat

SyntaxError: invalid syntax (<ipython-input-4-bc61328e12d1>, line 1)

In [5]:
help concat()

SyntaxError: invalid syntax (<ipython-input-5-584eb7a84509>, line 1)

In [6]:
?concat

Object `concat` not found.

In [7]:
pd.concat([df1, df2], axis = 0)

   var1  var2  var3   deg3
0     8     6   6.0    NaN
1     2     7   7.0    NaN
2     6     5   9.0    NaN
3     3     4   3.0    NaN
4     0     9   1.0    NaN
0   107   105   NaN  105.0
1   101   106   NaN  106.0
2   105   104   NaN  108.0
3   102   103   NaN  102.0
4    99   108   NaN  100.0

# merge / join

In [26]:
df1 = pd.DataFrame({'calisanlar': ['ali', 'veli', 'ayse', 'fatma'],
                    'grup'      : ['muhasebe', 'muhendislik', 'muhendislik', 'ik']})
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [38]:
df2 = pd.DataFrame({'calisanlar': ['ali', 'veli', 'ayse', 'fatma'],
                    'ilk_giris' : [2010, 2009, 2014, 2019]})
df2

  calisanlar  ilk_giris
0        ali       2010
1       veli       2009
2       ayse       2014
3      fatma       2019

In [16]:
df4 = pd.DataFrame({'grup' : ['muhasebe', 'muhendislik', 'ik'],
                    'mudur': ['caner', 'mustafa', 'berkcan']})
df4

          grup    mudur
0     muhasebe    caner
1  muhendislik  mustafa
2           ik  berkcan

In [17]:
df5 = pd.DataFrame({'grup'      : ['muhasebe', 'muhasebe', 'muhendislik', 'muhendislik', 'ik', 'ik'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux', 'excel', 'yonetim']})
df5

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  muhendislik    kodlama
3  muhendislik      linux
4           ik      excel
5           ik    yonetim

In [14]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     muhasebe       2010
1       Veli  muhendislik       2009
2       Ayse  muhendislik       2014
3      Fatma           ik       2019

In [15]:
pd.merge(df1, df2, on = 'calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     muhasebe       2010
1       Veli  muhendislik       2009
2       Ayse  muhendislik       2014
3      Fatma           ik       2019

In [18]:
df3 = pd.merge(df1, df2)

In [19]:
df3

  calisanlar         grup  ilk_giris
0        Ali     muhasebe       2010
1       Veli  muhendislik       2009
2       Ayse  muhendislik       2014
3      Fatma           ik       2019

In [20]:
pd.merge(df3, df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     muhasebe       2010    caner
1       Veli  muhendislik       2009  mustafa
2       Ayse  muhendislik       2014  mustafa
3      Fatma           ik       2019  berkcan

In [21]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     muhasebe  matematik
1        Ali     muhasebe      excel
2       Veli  muhendislik    kodlama
3       Veli  muhendislik      linux
4       Ayse  muhendislik    kodlama
5       Ayse  muhendislik      linux
6      Fatma           ik      excel
7      Fatma           ik    yonetim

In [22]:
df3 = pd.DataFrame({'name': ['ali', 'veli', 'ayse', 'fatma'],
                    'maas': [70000, 80000, 120000, 90000]})
df3

    name    maas
0    ali   70000
1   veli   80000
2   ayse  120000
3  fatma   90000

In [23]:
df1

  calisanlar         grup
0        Ali     muhasebe
1       Veli  muhendislik
2       Ayse  muhendislik
3      Fatma           ik

In [27]:
pd.merge(df1, df3, left_on = 'calisanlar', right_on = 'name')

  calisanlar         grup   name    maas
0        ali     muhasebe    ali   70000
1       veli  muhendislik   veli   80000
2       ayse  muhendislik   ayse  120000
3      fatma           ik  fatma   90000

In [29]:
pd.merge(df1, df3, left_on = 'calisanlar', right_on = 'name').drop('name', axis = 1)

  calisanlar         grup    maas
0        ali     muhasebe   70000
1       veli  muhendislik   80000
2       ayse  muhendislik  120000
3      fatma           ik   90000

In [31]:
df1a = df1.set_index('calisanlar')

In [33]:
df1a

                   grup
calisanlar
ali            muhasebe
veli        muhendislik
ayse        muhendislik
fatma                ik

In [34]:
df1a.shape

(4, 1)

In [40]:
df2a = df2.set_index('calisanlar')

In [36]:
df2a

            ilk_giris
calisanlar
Ali              2010
Veli             2009
Ayse             2014
Fatma            2019

In [41]:
pd.merge(df1a, df2a, left_index = True, right_index = True )

                   grup  ilk_giris
calisanlar
ali            muhasebe       2010
veli        muhendislik       2009
ayse        muhendislik       2014
fatma                ik       2019

In [42]:
df1a.join(df2a)

                   grup  ilk_giris
calisanlar
ali            muhasebe       2010
veli        muhendislik       2009
ayse        muhendislik       2014
fatma                ik       2019

In [43]:
dfa = pd.DataFrame({'calisanlar': ['ali', 'veli', 'ayse', 'fatma'],
                    'siralama'  : [1, 2,3,4]})
dfa

  calisanlar  siralama
0        ali         1
1       veli         2
2       ayse         3
3      fatma         4

In [44]:
dfb = pd.DataFrame({'calisanlar': ['ali', 'veli', 'ayse', 'fatma'],
                    'siralama'  : [3, 1, 4,2]})
dfb

  calisanlar  siralama
0        ali         3
1       veli         1
2       ayse         4
3      fatma         2

In [45]:
pd.merge(dfa, dfb, on = 'calisanlar')

  calisanlar  siralama_x  siralama_y
0        ali           1           3
1       veli           2           1
2       ayse           3           4
3      fatma           4           2

In [46]:
pd.merge(dfa, dfb, on = 'calisanlar', suffixes = ["_maas", "_deneyim"])

  calisanlar  siralama_maas  siralama_deneyim
0        ali              1                 3
1       veli              2                 1
2       ayse              3                 4
3      fatma              4                 2

In [47]:
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [48]:
df2

  calisanlar  ilk_giris
0        ali       2010
1       veli       2009
2       ayse       2014
3      fatma       2019

In [49]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  muhendislik       2009
2       ayse  muhendislik       2014
3      fatma           ik       2019

# Toplulastirma ve Gruplama (Aggregation & Grouping)

In [50]:
import seaborn as sns

In [51]:
df = sns.load_dataset("planets")

In [52]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load a dataset from the online repository (requires internet).

Parameters
----------
name : str
    Name of the dataset (`name`.csv on
    https://github.com/mwaskom/seaborn-data).  You can obtain list of
    available datasets using :func:`get_dataset_names`
cache : boolean, optional
    If True, then cache data locally and use the cache on subsequent calls
data_home : string, optional
    The directory in which to cache data. By default, uses ~/seaborn-data/
kws : dict, optional
    Passed to pandas.read_csv
File:      c:\users\ydran\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [53]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [54]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [55]:
df.shape

(1035, 6)

In [56]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [57]:
df["mass"].mean()

2.6381605847953233

In [59]:
df["mass"].min()

0.0036

In [60]:
df["mass"].sum()

1353.37638

In [61]:
df["mass"].std()

3.8186166509616046

In [63]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [64]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [66]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [67]:
df = pd.DataFrame({'gruplar': ['a', 'b', 'c', 'a', 'b', 'c'],
                   'veri'   : [10, 11, 52, 23, 43, 55]}, 
                  columns = ['gruplar', 'veri'])
df

  gruplar  veri
0       a    10
1       b    11
2       c    52
3       a    23
4       b    43
5       c    55

In [70]:
df.groupby("gruplar")

In [72]:
df.groupby("gruplar").mean()

         veri
gruplar
a        16.5
b        27.0
c        53.5

In [73]:
df.groupby("gruplar").sum()

         veri
gruplar
a          33
b          54
c         107

In [74]:
df = sns.load_dataset("planets")

In [75]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [76]:
df.groupby("method")

In [77]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [78]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [79]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [82]:
df = pd.DataFrame({"gruplar"  : ["a", "b", "c", "a", "b", "c"],
                   "degisken1": [10, 23, 33, 22, 11, 99],
                   "degisken2": [100, 253, 333, 262, 111, 969]},
                  columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [83]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
a               16        181
b               17        182
c               66        651

In [85]:
df.groupby("gruplar").aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
a              10     16  22       100    181  262
b              11     17  23       111    182  253
c              33     66  99       333    651  969

In [86]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
a               10        262
b               11        253
c               33        969

In [87]:
df = pd.DataFrame({"gruplar"  : ["a", "b", "c", "a", "b", "c"],
                   "degisken1": [10, 23, 33, 22, 11, 99],
                   "degisken2": [100, 253, 333, 262, 111, 969]},
                  columns = ["gruplar", "degisken1", "degisken2"])

In [88]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [91]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [94]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
a         8.485281  114.551299
b         8.485281  100.409163
c        46.669048  449.719913

In [93]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       c         33        333
5       c         99        969

In [95]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [96]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [100]:
df_a = df.iloc[:,1:3]

In [104]:
df_a.transform(lambda x: (x - x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [110]:
df = pd.DataFrame({"gruplar"  : ["a", "b", "c", "a", "b", "c"],
                   "degisken1": [10, 23, 33, 22, 11, 99],
                   "degisken2": [100, 253, 333, 262, 111, 969]},
                  columns = ["gruplar", "degisken1", "degisken2"])

In [111]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [112]:
df.apply(np.sum)

gruplar      abcabc
degisken1       198
degisken2      2028
dtype: object

In [114]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
a            aa         32        362
b            bb         34        364
c            cc        132       1302

In [115]:
    import pandas as pd
    import seaborn as sns
    titanic = sns.load_dataset("titanic")
    titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [122]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [125]:
titanic.groupby(["sex", "class"])["survived"].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [126]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [127]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [128]:
age = pd.cut(titanic["age"], [10, 18, 90] )

In [129]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7             NaN
8    (18.0, 90.0]
9    (10.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(10, 18] < (18, 90]]

In [138]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (10, 18]  1.000000  1.000000  0.523810
       (18, 90]  0.972973  0.900000  0.423729
male   (10, 18]  0.666667  0.000000  0.103448
       (18, 90]  0.375000  0.071429  0.133663

# Dis Kaynakli Veri Okumak

In [139]:
import pandas as pd

## csv okuma

In [140]:
pd.read_csv("reading_data/ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [141]:
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

## txt okuma

In [148]:
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [149]:
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [150]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [151]:
type(df)

pandas.core.frame.DataFrame

In [152]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [153]:
data = pd.read_csv("reading_data/data.txt")

In [154]:
data

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# Bonus: Problem Cozme ve Dokuman Okuma Kulturu